BobDeng1974/Nordic-mesh-light/nrf5_SDK_for_Mesh_v4.1.0_src/examples/light/src/main.c
        led1_config.on = true;
        led1_config.level = LED_LEVEL_DEFAULT;
        led1_config.min_level = 0;
        led1_config.max_level = UINT16_MAX;

        save_led_config();

        return BASE_COMMUNICATION_STATUS_SUCCESS;
    } else if (command->opcode == BASE_COMMUNICATION_SUB_COMMAND_IP_ADDR_GET) {

        ble_gap_addr_t ble_addr;
        sd_ble_gap_addr_get(&ble_addr);

        static uint8_t msg[6];
        msg[0] = ble_addr.addr[0];
        msg[1] = ble_addr.addr[1];
        msg[2] = ble_addr.addr[2];
        msg[3] = ble_addr.addr[3];
        msg[4] = ble_addr.addr[4];
        msg[5] = ble_addr.addr[5];

        p_response->response = &msg[0];
        p_response->length = 6;

        return BASE_COMMUNICATION_STATUS_MESSAGE;

    } else if (command->opcode == BASE_COMMUNICATION_SUB_COMMAND_FW_VERSION_GET) {

        static uint8_t msg[3];
        msg[1] = app_version;
        msg[2] = (app_build & 0xff);
        msg[3] = (app_build >> 8);

        p_response->response = &msg[0];
        p_response->length = 3;

        return BASE_COMMUNICATION_STATUS_MESSAGE;

    } 

    return BASE_COMMUNICATION_STATUS_ERROR_NO_HANDLER;
}

static void base_communication_command_timeout_cb(access_model_handle_t handle, void * p_client)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Acknowledged send timedout\n");
}

static void base_communication_command_status_cb(const base_communication_client_t * p_client, base_communication_status_t status, uint16_t src)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "src %02x \n", src);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "status %02x \n", status);
}

/****************************************************************************/

static void app_model_init(void)
{
    /* Instantiate onoff server on element index APP_ONOFF_ELEMENT_INDEX */
    ERROR_CHECK(app_onoff_init(&m_onoff_server_0, APP_ONOFF_ELEMENT_INDEX));
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App OnOff Model Handle: %d\n", m_onoff_server_0.server.model_handle);

    /* Instantiate level server on element index 0 */
    ERROR_CHECK(app_level_init(&m_level_server_0, APP_LEVEL_ELEMENT_INDEX));
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App Level Model Handle: %d\n", m_level_server_0.server.model_handle);

    m_base_communication_command_server.command_cb = base_communication_command_cb;
    ERROR_CHECK(base_communication_server_init(&m_base_communication_command_server, 0));
    ERROR_CHECK(access_model_subscription_list_alloc(m_base_communication_command_server.model_handle));

    m_base_communication_command_client.status_cb = base_communication_command_status_cb;
    m_base_communication_command_client.timeout_cb = base_communication_command_timeout_cb;
    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Initializing client %d\n", base_generic_client_init(&m_base_generic_command_client, 0));
    ERROR_CHECK(base_communication_client_init(&m_base_communication_command_client, 0));
    ERROR_CHECK(access_model_subscription_list_alloc(m_base_communication_command_client.model_handle));
}

/*************************************************************************************************/

static void node_reset(void) {
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- Node reset  -----\n");
    /* This function may return if there are ongoing flash operations. */
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_RESET);
    mesh_stack_device_reset();
}

static void factory_reset(void) {

//    if (mesh_stack_is_device_provisioned()) {
#if MESH_FEATURE_GATT_PROXY_ENABLED
        (void) proxy_stop();
#endif
        app_flash_clear(&led1_config, sizeof(led1_config));
        mesh_stack_config_clear();
        node_reset();
//    } else {
//        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "The device is unprovisioned. Resetting has no effect.\n");
//    }

}

static void config_server_evt_cb(const config_server_evt_t * p_evt) {
    if (p_evt->type == CONFIG_SERVER_EVT_NODE_RESET) {
        /* Trigger clearing of application data and schedule node reset. */
        factory_reset();
    } else if (p_evt->type == CONFIG_SERVER_EVT_APPKEY_ADD) {
        uint32_t status = app_config_bind_app_keys(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "bind_app_keys: %x\n",status);

         status = app_config_health_model_publication(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_health_model_publication: %x\n",status);

        status = app_config_led_status_model_publication(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_led_status_model_publication: %x\n",status);

        status = app_config_led_level_model_publication(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_led_level_model_publication: %x\n",status);

        status = app_config_subscription_to_communication_group(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_subscription_to_communication_group: %x\n",status);
        
        status = app_config_communication_client_model_publication(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_communication_client_model_publication: %x\n",status);
//        if (status != NRF_SUCCESS) {
//            configure_successfull = 0x03;
//            return;
//        }

    }
}

#if NRF_MESH_LOG_ENABLE
static const char m_usage_string[] = "run!\n";
#endif

static void button_event_handler(uint32_t button_number)
{
    /* Increase button number because the buttons on the board is marked with 1 to 4 */
    button_number++;
    uint16_t new_level = 0;
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Button %u pressed\n", button_number);
    switch (button_number) {
        case 1:{
            new_level = (led1_config.level < APP_LEVEL_STEP_SIZE) ? 0 : led1_config.level - APP_LEVEL_STEP_SIZE;
            break;
        }

        case 2: {
            new_level = ((UINT16_MAX - led1_config.level) < APP_LEVEL_STEP_SIZE) ? UINT16_MAX : led1_config.level + APP_LEVEL_STEP_SIZE;
            break;
        }

        case 3: {
            led1_state_on_set(!led1_config.on);
            app_onoff_status_publish(&m_onoff_server_0);
            break;
        }

        /* Initiate node reset */
        case 4: {
            /* Clear all the states to reset the node. */
            factory_reset();
            break;
        }

        default:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, m_usage_string);
            break;
    }

    if (button_number == 1 || button_number == 2) {
        led1_level_set(new_level);
        app_level_current_value_publish(&m_level_server_0);
    }
}

static void app_rtt_input_handler(int key)
{
    if (key >= '1' && key <= '4')
    {
        uint32_t button_number = key - '1';
        button_event_handler(button_number);
    }
    else
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, m_usage_string);
    }
}

static void device_identification_start_cb(uint8_t attention_duration_s)
{

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "device_identification_start_cb\n");

    hal_led_mask_set(LEDS_MASK, false);
    hal_led_blink_ms(BSP_LED_2_MASK  | BSP_LED_3_MASK,
                     LED_BLINK_ATTENTION_INTERVAL_MS,
                     LED_BLINK_ATTENTION_COUNT(attention_duration_s));
}

